# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige werkcollege de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [6]:
import pandas as pd
import sqlite3
import warnings
warnings.simplefilter('ignore')

Zet de volgende bestanden in een makkelijk te vinden map, als je dat nog niet gedaan hebt:
- go_sales.sqlite
- go_crm.sqlite
- go_staff.sqlite

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige werkcollege de code om een connectie met het bestand go_sales.sqlite te maken.

In [8]:
conn = sqlite3.connect("go_sales.sqlite")

Lees van de ingelezen go_sales-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [9]:
product = pd.read_sql("SELECT * FROM product", conn)
product_type = pd.read_sql("SELECT * FROM product_type", conn)
product_line = pd.read_sql("SELECT * FROM product_line", conn)
sales_staff = pd.read_sql("SELECT * FROM sales_staff", conn)
sales_branch = pd.read_sql("SELECT * FROM sales_branch", conn)
retailer_site = pd.read_sql("SELECT * FROM retailer_site", conn)
country = pd.read_sql("SELECT * FROM country", conn)
order_header = pd.read_sql("SELECT * FROM order_header", conn)
order_details = pd.read_sql("SELECT * FROM order_details", conn)
returned_item = pd.read_sql("SELECT * FROM returned_item", conn)
return_reason = pd.read_sql("SELECT * FROM return_reason", conn)

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt.<br> <u>Let op:</u> lees eventueel de informatie uit het vorige werkcollege nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [10]:
sql_query = "SELECT * FROM sqlite_master WHERE type='table';"
#Vul dit codeblok verder in
pd.read_sql(sql_query, conn)
#Op de puntjes hoort de connectie naar go_sales óf go_staff óf go_crm te staan.

,type,name,tbl_name,rootpage,sql
0,table,country,country,480,"CREATE TABLE ""country"" (\n\t""COUNTRY_CODE""\tIN..."
1,table,order_details,order_details,11,"CREATE TABLE ""order_details"" (\n\t""ORDER_DETAI..."
2,table,order_header,order_header,24,"CREATE TABLE ""order_header"" (\n\t""ORDER_NUMBER..."
3,table,order_method,order_method,27,"CREATE TABLE ""order_method"" (\n\t""ORDER_METHOD..."
4,table,product,product,28,"CREATE TABLE ""product"" (\n\t""PRODUCT_NUMBER""\t..."
5,table,product_line,product_line,17,"CREATE TABLE ""product_line"" (\n\t""PRODUCT_LINE..."
6,table,product_type,product_type,10,"CREATE TABLE ""product_type"" (\n\t""PRODUCT_TYPE..."
7,table,retailer_site,retailer_site,18,"CREATE TABLE ""retailer_site"" (\n\t""RETAILER_SI..."
8,table,return_reason,return_reason,30,"CREATE TABLE ""return_reason"" (\n\t""RETURN_REAS..."
9,table,returned_item,returned_item,31,"CREATE TABLE ""returned_item"" (\n\t""RETURN_CODE..."
10,table,sales_branch,sales_branch,2,"CREATE TABLE ""sales_branch"" (\n\t""SALES_BRANCH..."
11,table,sales_staff,sales_staff,3,"CREATE TABLE ""sales_staff"" (\n\t""SALES_STAFF_C..."

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [21]:
product_overview = product.loc[
    (product["PRODUCTION_COST"] < 100) & (product["PRODUCTION_COST"] > 50),
      ["PRODUCT_NAME", "PRODUCTION_COST"]]

product_overview

                        PRODUCT_NAME  PRODUCTION_COST
5          TrailChef Deluxe Cook Set            85.11
7             TrailChef Double Flame            75.00
16                   Hibernator Lite            60.00
17                        Hibernator            86.00
19   Hibernator Self - Inflating Mat            78.55
22               Hibernator Camp Cot            65.33
23      Canyon Mule Climber Backpack            62.50
45           Granite Climbing Helmet            52.86
47             Husky Harness Extreme            55.00
57                    Granite Hammer            57.13
68                         Polar Ice            73.33
69                      Polar Sports            80.00
70                        Polar Wave            60.00
71                     Polar Extreme            72.50
74                      Edge Extreme            80.00
77                         Seeker 35            79.19
78                         Seeker 50            92.58
79                    Seeker Extreme            94.12
82                    Glacier Deluxe            56.25
83                       Glacier GPS            78.55
109                Blue Steel Putter            60.00
110            Blue Steel Max Putter            81.80
113              Course Pro Golf Bag            80.00

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [25]:
product_marge = product.loc[
    (product["MARGIN"] < 0.2) | (product["MARGIN"] > 0.6), ["PRODUCT_NAME", "MARGIN"]
]
product_marge

                    PRODUCT_NAME  MARGIN
20                Hibernator Pad    0.17
23  Canyon Mule Climber Backpack    0.17
85             BugShield Natural    0.67
86               BugShield Spray    0.67
87         BugShield Lotion Lite    0.70
88              BugShield Lotion    0.63
89             BugShield Extreme    0.63

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [29]:
franc_countries = country.loc[country["CURRENCY_NAME"] == "francs", ["COUNTRY"]]

franc_countries

        COUNTRY
0        France
7   Switzerland
15      Belgium

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [83]:
product_introdates = product.loc[product["MARGIN"] > 0.5,["INTRODUCTION_DATE"]].drop_duplicates()

product_introdates

    INTRODUCTION_DATE
66         2000-10-26
85         1995-02-15
101        2003-12-10
103        2003-12-18
104        2003-12-27
106        2004-01-13
110        2003-12-15

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [44]:
sales_branch_stad = sales_branch.loc[(sales_branch["ADDRESS2"].notna() & sales_branch["REGION"].notna()), ["ADDRESS1", "CITY"]]

sales_branch_stad

                            ADDRESS1              CITY
2                Singelgravenplein 4         Amsterdam
13  Prol. Paseo de la Reforma No. 51  Distrito Federal
14               202-2-3 Hyakunincho             Tokyo
15                     543-225 Asahi        Osaka City
16                  2315 Queen's Ave         Melbourne
18             Avenida Paulista, 333         São Paulo
24                    3 Albany Court        Birmingham

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [47]:
dollar_countries = country.loc[(country["CURRENCY_NAME"] == "dollars") | (country["CURRENCY_NAME"] == "new dollar"),["COUNTRY"]].sort_values(by="COUNTRY")

dollar_countries

          COUNTRY
14      Australia
3          Canada
11         Taiwan
2   United States

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [ ]:
retailer_site_overview = retailer_site.loc[(retailer_site["POSTAL_ZONE"].str.startswith("D") & retailer_site["ADDRESS2"].notna())
                                           ,["ADDRESS1", "ADDRESS2", "CITY"]]

retailer_site_overview

            ADDRESS1       ADDRESS2       CITY
31  Röntgenstraße 90  3. Tür rechts  Frankfurt
59   Grubesallee 141       4. Stock    Hamburg

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [66]:
products_returned = returned_item["RETURN_QUANTITY"].count()

print(products_returned)

619

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [70]:
sales_branch_regions = sales_branch["REGION"].nunique()

print(sales_branch_regions)

15

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [82]:
import numpy as np
maximum = pd.Series(product["MARGIN"].max())
minimum = pd.Series(product["MARGIN"].min())
average = pd.Series(round(np.mean(product["MARGIN"]), 2))

pd.concat([maximum, minimum, average], axis= 1)

     0     1    2
0  0.7  0.17  0.4

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [104]:
adress2_unkown = retailer_site["ADDRESS2"].isna().sum()

print(adress2_unkown)

286

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [105]:
avg_price = round(np.mean(order_details.loc[(order_details["UNIT_SALE_PRICE"] < order_details["UNIT_PRICE"]), ["UNIT_COST"]]), 2)

print(avg_price)

127.34

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [124]:
medewerkers = sales_staff.groupby("POSITION_EN")["SALES_STAFF_CODE"].count()

medewerkers

POSITION_EN
Branch Manager                  19
District Manager                 4
General Manager                  1
Level 1 Sales Representative    13
Level 2 Sales Representative    39
Level 3 Sales Representative    24
Regional Manager                 2
Name: SALES_STAFF_CODE, dtype: int64

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [122]:
staff_per_phone = sales_staff.loc[sales_staff.groupby("WORK_PHONE")["SALES_STAFF_CODE"].count(), ["WORK_PHONE", "SALES_STAFF_CODE"]].groupby("WORK_PHONE")["SALES_STAFF_CODE"].count()

staff_per_phone

WORK_PHONE
+(49) 40 663 1990    15
+33 1 68 94 52 20    14
Name: SALES_STAFF_CODE, dtype: int64

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [131]:
address_nl = pd.merge(retailer_site, country, left_on="COUNTRY_CODE", right_on="COUNTRY_CODE")

address_nl = address_nl.loc[(address_nl["COUNTRY"] == "Netherlands"),["ADDRESS1", "CITY", "COUNTRY"]]

address_nl

                      ADDRESS1          CITY      COUNTRY
240                   Beets 36         Beets  Netherlands
241               Perestraat 1      Deventer  Netherlands
242  Laan van Meerdervoort 966      Den Haag  Netherlands
243             Kalfjeslaan 47    Amstelveen  Netherlands
244               Startbaan 11    Amstelveen  Netherlands
245      Noorderspoorsingel 28     Groningen  Netherlands
246              Hogehilweg 13     Amsterdam  Netherlands
247             Spoorstraat 43    Varsseveld  Netherlands
248             Westhavenweg 8     Amsterdam  Netherlands
249              Westzeedijk 4        Muiden  Netherlands
250            Gooiergracht 91         Laren  Netherlands
251            Hoofdstraat 150   Pieterburen  Netherlands
252                Olde Diek 2         Laren  Netherlands
253     Amsterdamsestraatweg 8      Maarssen  Netherlands
254        Krayenhoffstraat 11     Amsterdam  Netherlands
255         Overschiestraat 19     Amsterdam  Netherlands
256              Havenbuurt 12        Marken  Netherlands
257               Duivendaal 1    Wageningen  Netherlands
258              Voorstraat 37  Nieuweschans  Netherlands
259         Stadhouderslaan 18     Rotterdam  Netherlands

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [136]:
eyewear_overview = pd.merge(product, product_type, left_on="PRODUCT_TYPE_CODE", right_on="PRODUCT_TYPE_CODE")
eyewear_overview = eyewear_overview.loc[eyewear_overview["PRODUCT_TYPE_EN"] == "Eyewear",["PRODUCT_NAME"]]

eyewear_overview

     PRODUCT_NAME
67      Polar Sun
68      Polar Ice
69   Polar Sports
70     Polar Wave
71  Polar Extreme

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [143]:
unique_addresses = pd.merge(order_header, sales_staff, left_on="SALES_STAFF_CODE", right_on="SALES_STAFF_CODE")
unique_addresses = pd.merge(retailer_site, unique_addresses, left_on="RETAILER_SITE_CODE", right_on="RETAILER_SITE_CODE")

unique_addresses = unique_addresses.loc[(unique_addresses["POSITION_EN"] == "Branch Manager"),[ "ADDRESS1", "FIRST_NAME", "LAST_NAME"]].drop_duplicates()
unique_addresses

                  ADDRESS1 FIRST_NAME LAST_NAME
3658  Alameda Santos, 9876     Bayard     Lopes

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

In [160]:
manager_sales = pd.merge(sales_staff, order_header, left_on="SALES_STAFF_CODE",how="outer" ,right_on="SALES_STAFF_CODE")
# sales_staff["POSITION_EN"]  
# order_header["ORDER_DATE"]

manager_sales = manager_sales.loc[manager_sales["POSITION_EN"].str.contains("Manager"),["POSITION_EN", "ORDER_DATE"]].drop_duplicates()
manager_sales

           POSITION_EN  ORDER_DATE
0       Branch Manager         NaN
320   Regional Manager         NaN
648   District Manager         NaN
3748    Branch Manager  2024-09-09
3749    Branch Manager  2024-03-13
3750    Branch Manager  2024-01-09
4186   General Manager         NaN

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

In [164]:
# product["PRODUCT_NAME"]
# product_type["PRODUCT_TYPE_EN"]
# WHERE order_details["QUANTITY"] > 750

bulk_sold = pd.merge(product, product_type, left_on="PRODUCT_TYPE_CODE", right_on="PRODUCT_TYPE_CODE")
bulk_sold = pd.merge(order_details, bulk_sold, left_on="PRODUCT_NUMBER", right_on="PRODUCT_NUMBER")

bulk_sold = bulk_sold.loc[bulk_sold["QUANTITY"] > 750,["PRODUCT_NAME", "PRODUCT_TYPE_EN"]].drop_duplicates()
bulk_sold

                PRODUCT_NAME    PRODUCT_TYPE_EN
539        BugShield Extreme  Insect Repellents
1759                Star Peg              Tents
20121  BugShield Lotion Lite  Insect Repellents
20147         Sun Shelter 15          Sunscreen
20152         Sun Shelter 30          Sunscreen
31236        BugShield Spray  Insect Repellents
37272              Firefly 2           Lanterns
37348       BugShield Lotion  Insect Repellents
37363             Sun Shield          Sunscreen

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

In [171]:
# product["PRODUCT_NAME"]
# WHERE order_details[(unit_price - unit_sale_price) / unit_price] > 0.4

high_sales = pd.merge(product, order_details, left_on="PRODUCT_NUMBER", right_on="PRODUCT_NUMBER")
sale_amount = (high_sales["UNIT_PRICE"] - high_sales["UNIT_SALE_PRICE"]) / high_sales["UNIT_PRICE"]

high_sales = high_sales.loc[sale_amount > 0.4,["PRODUCT_NAME"]].drop_duplicates()
high_sales

                       PRODUCT_NAME
27830             BugShield Natural
28283               BugShield Spray
28694         BugShield Lotion Lite
29127              BugShield Lotion
29464             BugShield Extreme
30562                Sun Shelter 15
30929                Sun Shelter 30
34441  Hailstorm Titanium Woods Set

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

In [181]:
# return_reason["RETURN_DESCRIPTION_EN"]
# WHERE (returned_item["RETURN_QUANTITY"] / order_details["QUANTITY"]) > 0.9

mass_returned = pd.merge(returned_item, return_reason, left_on="RETURN_REASON_CODE", right_on="RETURN_REASON_CODE")
mass_returned = pd.merge(order_details, mass_returned, left_on="ORDER_DETAIL_CODE", right_on="ORDER_DETAIL_CODE")
mass_returned["RETURN_PERCENTAGE"] = mass_returned["RETURN_QUANTITY"] / mass_returned["QUANTITY"]

mass_returned = mass_returned.loc[mass_returned["RETURN_PERCENTAGE"] > 0.9,["RETURN_DESCRIPTION_EN"]].drop_duplicates()
mass_returned

    RETURN_DESCRIPTION_EN
0   Wrong product ordered
4   Wrong product shipped
5  Unsatisfactory product

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (6 kolommen, 10 rijen)

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 29 rijen)

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [2]:
from datetime import date
date.today().year

2026

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [3]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 30 jaar in dienst) of een ‘lang in dienst’ (groter dan gelijk aan 30 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)